<template>
    <div>
        <div v-if="!common.isEmpty(article)">
            <!-- 封面 -->
            <div class="article-head my-animation-slide-top">
                <!-- 背景图片 -->
                <el-image class="article-image my-el-image" v-once lazy :src="article.articleCover" fit="cover">
                    <template v-slot:error>
                        <div class="image-slot">
                            <div class="article-image"></div>
                        </div>
                    </template>
                </el-image>
                <!-- 文章信息 -->
                <div class="article-info-container">
                    <div class="article-title">{{ article.articleTitle }}</div>
                    <div class="article-info">
                        <svg viewBox="0 0 1024 1024" width="14" height="14" style="vertical-align: -2px">
                            <path
                                d="M510.4 65.5l259.69999999 0 1e-8 266.89999999c0 147.50000001-116.2 266.89999999-259.7 266.90000001-143.4 0-259.7-119.5-259.7-266.90000001 0.1-147.5 116.3-266.9 259.7-266.89999999z"
                                fill="#FF9FCF"></path>
                            <path
                                d="M698.4 525.2l-13 0c53-48.4 86.5-117.8 86.5-195.20000001 0-10.2-0.7-20.3-1.8-30.19999999C613.8 377.50000001 438.6 444.9 266 437.7c15 33.4 36.7 63.1 63.5 87.5l-5.3 0c-122.6 0-225.5 88.1-248.8 204.1C340 677.2 597.7 609.2 862.2 585.7c-44.3-37.6-101.5-60.5-163.8-60.5z"
                                fill="#FF83BB"></path>
                            <path
                                d="M862.2 585.7C597.7 609.2 340 677.2 75.4 729.3c-3.2 16.1-5 32.6-5 49.6 0 99.8 81.7 181.5 181.5 181.5l518.6 0c99.8 0 181.5-81.7 181.5-181.5 0.1-77.2-35-146.5-89.8-193.2z"
                                fill="#FF5390"></path>
                            <path
                                d="M770.1 299.8C755.1 168 643.3 65.5 507.4 65.5c-146.1 0-264.5 118.4-264.5 264.5 0 38.4 8.3 74.8 23.1 107.7 172.6 7.2 347.8-60.2 504.1-137.9z"
                                fill="#FF9FCF"></path>
                            <path
                                d="M436.4 282.1c0 24.1-19.6 43.7-43.7 43.7S349 306.2 349 282.1s19.6-43.7 43.7-43.7c24.19999999 0 43.7 19.6 43.7 43.7z"
                                fill="#FFFFFF"></path>
                            <path d="M625 282.1m-43.7 0a43.7 43.7 0 1 0 87.4 0 43.7 43.7 0 1 0-87.4 0Z" fill="#FFFFFF">
                            </path>
                        </svg>
                        <span>&nbsp;{{ article.username }}</span>
                        <span>·</span>
                        <svg viewBox="0 0 1024 1024" width="14" height="14" style="vertical-align: -2px">
                            <path d="M512 512m-512 0a512 512 0 1 0 1024 0 512 512 0 1 0-1024 0Z" fill="#409EFF"></path>
                            <path
                                d="M654.222222 256c-17.066667 0-28.444444 11.377778-28.444444 28.444444v56.888889c0 17.066667 11.377778 28.444444 28.444444 28.444445s28.444444-11.377778 28.444445-28.444445v-56.888889c0-17.066667-11.377778-28.444444-28.444445-28.444444zM369.777778 256c-17.066667 0-28.444444 11.377778-28.444445 28.444444v56.888889c0 17.066667 11.377778 28.444444 28.444445 28.444445s28.444444-11.377778 28.444444-28.444445v-56.888889c0-17.066667-11.377778-28.444444-28.444444-28.444444z"
                                fill="#FFFFFF"></path>
                            <path
                                d="M725.333333 312.888889H711.111111v28.444444c0 31.288889-25.6 56.888889-56.888889 56.888889s-56.888889-25.6-56.888889-56.888889v-28.444444h-170.666666v28.444444c0 31.288889-25.6 56.888889-56.888889 56.888889s-56.888889-25.6-56.888889-56.888889v-28.444444h-14.222222c-22.755556 0-42.666667 19.911111-42.666667 42.666667v341.333333c0 22.755556 19.911111 42.666667 42.666667 42.666667h426.666666c22.755556 0 42.666667-19.911111 42.666667-42.666667v-341.333333c0-22.755556-19.911111-42.666667-42.666667-42.666667zM426.666667 654.222222h-56.888889c-17.066667 0-28.444444-11.377778-28.444445-28.444444s11.377778-28.444444 28.444445-28.444445h56.888889c17.066667 0 28.444444 11.377778 28.444444 28.444445s-11.377778 28.444444-28.444444 28.444444z m227.555555 0h-56.888889c-17.066667 0-28.444444-11.377778-28.444444-28.444444s11.377778-28.444444 28.444444-28.444445h56.888889c17.066667 0 28.444444 11.377778 28.444445 28.444445s-11.377778 28.444444-28.444445 28.444444z m0-113.777778h-56.888889c-17.066667 0-28.444444-11.377778-28.444444-28.444444s11.377778-28.444444 28.444444-28.444444h56.888889c17.066667 0 28.444444 11.377778 28.444445 28.444444s-11.377778 28.444444-28.444445 28.444444z"
                                fill="#FFFFFF"></path>
                        </svg>
                        <span>&nbsp;{{ article.createTime }}</span>
                        <span>·</span>
                        <svg viewBox="0 0 1024 1024" width="14" height="14" style="vertical-align: -2px">
                            <path d="M14.656 512a497.344 497.344 0 1 0 994.688 0 497.344 497.344 0 1 0-994.688 0z"
                                fill="#FF0000">
                            </path>
                            <path
                                d="M374.976 872.64c-48.299-100.032-22.592-157.44 14.421-211.37 40.448-58.966 51.115-117.611 51.115-117.611s31.659 41.386 19.115 106.005c56.149-62.72 66.816-162.133 58.325-200.405 127.317 88.746 181.59 281.002 108.181 423.381C1016 652.501 723.093 323.2 672.277 285.867c16.939 37.333 20.054 100.032-14.101 130.474-58.027-219.84-201.664-265.002-201.664-265.002 16.96 113.536-61.781 237.397-137.344 330.24-2.816-45.163-5.632-76.544-29.483-119.808-5.333 82.176-68.373 149.269-85.29 231.445-22.912 111.637 17.237 193.173 170.581 279.424z"
                                fill="#FFFFFF"></path>
                        </svg>
                        <span>&nbsp;{{ article.viewCount }}</span>
                        <span>·</span>
                        <svg viewBox="0 0 1024 1024" width="14" height="14" style="vertical-align: -2px">
                            <path
                                d="M113.834667 291.84v449.194667a29.013333 29.013333 0 0 0 28.842666 29.013333h252.928v90.453333l160.597334-90.453333h252.928a29.013333 29.013333 0 0 0 29.013333-29.013333V291.84a29.013333 29.013333 0 0 0-29.013333-29.013333h-665.6a29.013333 29.013333 0 0 0-29.696 29.013333z"
                                fill="#FFDEAD"></path>
                            <path
                                d="M809.130667 262.826667h-665.6a29.013333 29.013333 0 0 0-28.842667 29.013333v40.106667a29.013333 29.013333 0 0 1 28.842667-29.013334h665.6a29.013333 29.013333 0 0 1 29.013333 29.013334V291.84a29.013333 29.013333 0 0 0-29.013333-29.013333z"
                                fill="#FFF3DB"></path>
                            <path
                                d="M556.202667 770.048h252.928a29.013333 29.013333 0 0 0 29.013333-29.013333V362.837333s-59.733333 392.533333-724.309333 314.709334v63.488a29.013333 29.013333 0 0 0 28.842666 29.013333h253.098667v90.453333z"
                                fill="#F2C182"></path>
                            <path
                                d="M619.008 632.32l101.888-35.157333-131.754667-76.117334 29.866667 111.274667zM891.904 148.992a61.44 61.44 0 0 0-84.138667 22.528l-19.968 34.133333 106.666667 61.610667 19.968-34.133333a61.781333 61.781333 0 0 0-22.528-84.138667z"
                                fill="#69BAF9"></path>
                            <path d="M775.338667 198.775467l131.669333 76.032-186.026667 322.218666-131.6864-76.032z"
                                fill="#F7FBFF">
                            </path>
                            <path
                                d="M775.168 198.826667l-5.290667 9.216 59.221334 34.133333a34.133333 34.133333 0 0 1 12.458666 46.592l-139.946666 242.346667a34.133333 34.133333 0 0 1-46.762667 12.629333l-59.050667-34.133333-6.656 11.434666 88.746667 51.2L720.896 597.333333l186.026667-322.56z"
                                fill="#D8E3F0"></path>
                            <path
                                d="M616.448 622.592l2.56 9.728 101.888-35.157333-44.885333-25.941334-59.562667 51.370667zM891.904 148.992c-1.024 0-2.218667-0.853333-3.242667-1.536A61.610667 61.610667 0 0 1 887.466667 204.8l-19.968 34.133333-73.728-42.496-5.12 8.704 106.666666 61.610667 19.968-34.133333a61.781333 61.781333 0 0 0-23.381333-83.626667z"
                                fill="#599ED4"></path>
                            <path
                                d="M265.898667 417.621333H494.933333a17.066667 17.066667 0 1 0 0-34.133333H265.898667a17.066667 17.066667 0 1 0 0 34.133333zM265.898667 533.504H494.933333a17.066667 17.066667 0 0 0 0-34.133333H265.898667a17.066667 17.066667 0 0 0 0 34.133333z"
                                fill="#3D3D63"></path>
                            <path
                                d="M959.488 354.645333a99.84 99.84 0 0 0-23.722667-127.488 78.677333 78.677333 0 0 0-142.848-64.170666l-11.605333 20.138666a17.066667 17.066667 0 0 0-20.821333 7.168l-32.085334 55.466667H142.677333a46.250667 46.250667 0 0 0-45.909333 46.08v449.194667a46.08 46.08 0 0 0 45.909333 46.08h236.032v73.386666a17.066667 17.066667 0 0 0 8.362667 14.848 17.066667 17.066667 0 0 0 8.704 2.218667 17.066667 17.066667 0 0 0 8.362667-2.218667l156.672-88.234666h248.32a46.08 46.08 0 0 0 46.08-46.08V398.677333L921.6 283.306667a17.066667 17.066667 0 0 0-4.266667-21.504l1.877334-3.413334a65.365333 65.365333 0 0 1 10.410666 79.189334l-53.077333 91.989333a56.832 56.832 0 0 0 20.821333 77.653333 17.066667 17.066667 0 0 0 24.234667-6.314666 17.066667 17.066667 0 0 0-6.997333-23.04 23.04 23.04 0 0 1-8.362667-31.061334z m-138.410667 386.389334a11.946667 11.946667 0 0 1-11.946666 11.946666H556.202667a17.066667 17.066667 0 0 0-8.362667 2.218667l-134.997333 76.117333v-61.269333a17.066667 17.066667 0 0 0-17.066667-17.066667H142.677333a11.946667 11.946667 0 0 1-11.776-11.946666V291.84a11.946667 11.946667 0 0 1 11.776-11.946667h565.930667L574.464 512a17.066667 17.066667 0 0 0-1.706667 12.970667L597.333333 615.253333H265.898667a17.066667 17.066667 0 1 0 0 34.133334h352.938666a17.066667 17.066667 0 0 0 5.802667 0l102.4-35.328a17.066667 17.066667 0 0 0 9.216-7.509334l85.333333-147.968z m-204.8-184.661334l63.829334 36.864-49.322667 17.066667z m206.848-170.666666v1.365333l-108.373333 186.709333-102.4-59.050666L781.482667 221.866667l102.4 59.050666z m76.458667-161.28L887.466667 244.224l-76.970667-44.373333 11.264-19.797334a44.544 44.544 0 1 1 77.141333 44.544z"
                                fill="#3D3D63"></path>
                        </svg>
                        <span>&nbsp;{{ article.commentCount }}</span>
                    </div>
                </div>

                <div class="article-info-news" @click="weiYanDialogVisible = true" v-if="
                    !common.isEmpty(store.state.currentUser) && store.state.currentUser.id === article.userId">
                    <svg width="30" height="30" viewBox="0 0 1024 1024">
                        <path d="M0 0h1024v1024H0V0z" fill="#202425" opacity=".01"></path>
                        <path
                            d="M989.866667 512c0 263.918933-213.947733 477.866667-477.866667 477.866667S34.133333 775.918933 34.133333 512 248.081067 34.133333 512 34.133333s477.866667 213.947733 477.866667 477.866667z"
                            fill="#FF7744"></path>
                        <path
                            d="M512 221.866667A51.2 51.2 0 0 1 563.2 273.066667v187.733333H750.933333a51.2 51.2 0 0 1 0 102.4h-187.733333V750.933333a51.2 51.2 0 0 1-102.4 0v-187.733333H273.066667a51.2 51.2 0 0 1 0-102.4h187.733333V273.066667A51.2 51.2 0 0 1 512 221.866667z"
                            fill="#FFFFFF"></path>
                    </svg>
                </div>
            </div>
            <!-- 文章 -->
            <div style="background: var(--background)">
                <div class="article-container my-animation-slide-bottom">
                    <div v-if="!common.isEmpty(article.videoUrl)" style="margin-bottom: 20px">
                        <VideoPlayer :url="common.decrypt(article.videoUrl)" :cover="article.articleCover">
                        </VideoPlayer>
                    </div>

                    <!-- 最新进展 -->
                    <div v-if="!common.isEmpty(treeHoleList)" class="process-wrap">
                        <el-collapse accordion value="1">
                            <el-collapse-item title="最新进展" name="1">
                                <Process :treeHoleList="treeHoleList" @deleteTreeHole="deleteTreeHole"></Process>
                            </el-collapse-item>
                        </el-collapse>

                        <hr />
                    </div>

                    <!-- 文章内容 -->
                    <div v-html="articleContentHtml" class="entry-content"></div>
                    <!-- 最后更新时间 -->
                    <div class="article-update-time">
                        <span>文章最后更新于 {{ article.updateTime }}</span>
                    </div>
                    <!-- 分类 -->
                    <div class="article-sort">
                        <span @click="
                            router.push({
                                path: '/sort',
                                query: { sortId: article.sortId, labelId: article.labelId },
                            })
                            ">
                            {{ article.sort.sortName + ' ▶ ' + article.label.labelName }}
                        </span>
                    </div>
                    <!-- 作者信息 -->
                    <blockquote>
                        <div>作者：{{ article.username }}</div>
                        <div>
                            <span>版权&许可请详阅</span>
                            <span style="color: #38f; cursor: pointer" @click="copyrightDialogVisible = true">
                                版权声明
                            </span>
                        </div>
                    </blockquote>
                    <!-- 订阅 -->
                    <div class="myCenter" id="article-like" @click="subscribeLabel()">
                        <el-icon class="article-like-icon" :class="{ 'article-like': subscribe }">
                            <Pointer />
                        </el-icon>
                    </div>

                    <!-- 评论 -->
                    <div v-if="article.commentStatus === true">
                        <Comment :type="'article'" :source="article.id" :userId="article.userId"
                            :sortId="article.sortId" ref="comment">
                        </Comment>
                    </div>
                </div>

                <div id="toc" class="toc"></div>
            </div>

            <div style="background: var(--background)">
                <MyFooter></MyFooter>
            </div>
        </div>

        <div id="toc-button" @click="clickTocButton()">
            <i class="fa fa-align-justify" aria-hidden="true"></i>
        </div>

        <el-dialog draggable title="版权声明" v-model="copyrightDialogVisible" width="80%" :append-to-body="true"
            class="article-copy" center top="25vh">
            <div style="display: flex; align-items: center; flex-direction: column">
                <el-avatar shape="square" :size="35" :src="store.state.webInfo.avatar"></el-avatar>
                <div class="copyright-container">
                    <p>
                        {{ store.state.webInfo.webName }}是指运行在{{
                            constant.host
                        }}域名及相关子域名上的网站，本条款描述了{{
                            store.state.webInfo.webName
                        }}的网站版权声明：
                    </p>
                    <ul>
                        <li>
                            {{
                                store.state.webInfo.webName
                            }}提供的所有文章、展示的图片素材等内容部分来源于互联网平台，仅供学习参考。如有侵犯您的版权，请联系{{
                                store.state.webInfo.webName
                            }}负责人，{{
                                store.state.webInfo.webName
                            }}承诺将在一个工作日内改正。
                        </li>
                        <li>
                            {{
                                store.state.webInfo.webName
                            }}不保证网站内容的全部准确性、安全性和完整性，请您在阅读、下载及使用过程中自行确认，{{
                                store.state.webInfo.webName
                            }}亦不承担上述资源对您造成的任何形式的损失或伤害。
                        </li>
                        <li>
                            未经{{
                                store.state.webInfo.webName
                            }}允许，不得盗链、盗用本站内容和资源。
                        </li>
                        <li>
                            {{ store.state.webInfo.webName }}旨在为广大用户提供更多的信息；{{
                                store.state.webInfo.webName
                            }}不保证向用户提供的外部链接的准确性和完整性，该外部链接指向的不由本站实际控制的任何网页上的内容，{{
                                store.state.webInfo.webName
                            }}对其合法性亦概不负责，亦不承担任何法律责任。
                        </li>
                        <li>
                            {{
                                store.state.webInfo.webName
                            }}中的文章/视频（包括转载文章/视频）的版权仅归原作者所有，若作者有版权声明或文章从其它网站转载而附带有原所有站的版权声明者，其版权归属以附带声明为准；文章仅代表作者本人的观点，与{{
                                store.state.webInfo.webName
                            }}立场无关。
                        </li>
                        <li>
                            {{ store.state.webInfo.webName }}自行编写排版的文章均采用
                            <a href="https://creativecommons.org/licenses/by-nc-sa/4.0/"
                                style="color: #38f; text-decoration: none">
                                知识共享署名-非商业性使用-相同方式共享 4.0 国际许可协议
                            </a>
                        </li>
                        <li>
                            许可协议标识：
                            <a href="https://creativecommons.org/licenses/by-nc-sa/4.0/">
                                <img alt="知识共享许可协议" src="https://i.creativecommons.org/l/by-nc-sa/4.0/88x31.png"
                                    style="margin-top: 5px" />
                            </a>
                        </li>
                    </ul>
                </div>
            </div>
        </el-dialog>

        <el-dialog draggable title="最新进展" v-model="weiYanDialogVisible" width="40%" :append-to-body="true"
            :close-on-click-modal="false" destroy-on-close center top="25vh">
            <div>
                <div class="myCenter" style="margin-bottom: 20px">
                    <el-date-picker v-model="newsTime" value-format="yyyy-MM-dd HH:mm:ss" type="datetime" align="center"
                        placeholder="选择日期时间">
                    </el-date-picker>
                </div>
                <CommentBox @submitComment="submitWeiYan"></CommentBox>
            </div>
        </el-dialog>

        <el-dialog draggable title="购买文章支付" v-model="buyArticleDialog" width="45%" :append-to-body="true"
            :close-on-click-modal="false" destroy-on-close top="25vh" class="buy-artcile" :show-close="false">
            <div class="text-box">
                <div class="red-text">
                    <div>
                        【付费】查阅文章之前，需支付{{ payInfo.amount }}元，
                    </div>
                    <div style="margin-top: 10px;display: flex;justify-content:start;">
                        <span style="width: 11%;">作者说：</span>
                        <span style="width: 86%;">{{ payInfo.tips }}</span>
                    </div>
                    <div style="margin-top: 10px;">
                        注意：此次收费为买断制，支付成功后当前账号查阅无需收费！
                    </div>
                </div>
                <div class="warn-text myCenter">
                    <svg t="1725769112675" class="icon" viewBox="0 0 1024 1024" version="1.1"
                        xmlns="http://www.w3.org/2000/svg" p-id="5482" width="32" height="32">
                        <path
                            d="M523.5712 906.0352c-218.9312 0-397.056-178.1248-397.056-397.056s178.1248-397.056 397.056-397.056 397.056 178.1248 397.056 397.056-178.1248 397.056-397.056 397.056z m0-742.9632c-190.72 0-345.856 155.136-345.856 345.856s155.136 345.856 345.856 345.856 345.856-155.136 345.856-345.856-155.136-345.856-345.856-345.856z"
                            fill="#606D87" p-id="5483"></path>
                        <path
                            d="M649.6768 491.2128H397.4656c-14.1312 0-25.6-11.4688-25.6-25.6s11.4688-25.6 25.6-25.6h252.2624c14.1312 0 25.6 11.4688 25.6 25.6s-11.4688 25.6-25.6512 25.6zM649.6768 594.5344H397.4656c-14.1312 0-25.6-11.4688-25.6-25.6s11.4688-25.6 25.6-25.6h252.2624c14.1312 0 25.6 11.4688 25.6 25.6s-11.4688 25.6-25.6512 25.6z"
                            fill="#FFAF50" p-id="5484"></path>
                        <path
                            d="M523.5712 748.6976c-14.1312 0-25.6-11.4688-25.6-25.6v-257.536c0-14.1312 11.4688-25.6 25.6-25.6s25.6 11.4688 25.6 25.6v257.536c0 14.1312-11.4688 25.6-25.6 25.6z"
                            fill="#FFAF50" p-id="5485"></path>
                        <path
                            d="M521.1136 483.7376c-6.912 0-13.7728-2.7648-18.8416-8.2432L389.5808 353.2288a25.57952 25.57952 0 0 1 1.4848-36.1472 25.57952 25.57952 0 0 1 36.1472 1.4848l112.6912 122.2656a25.57952 25.57952 0 0 1-1.4848 36.1472c-4.9152 4.5568-11.1104 6.7584-17.3056 6.7584z"
                            fill="#FFAF50" p-id="5486"></path>
                        <path
                            d="M523.5712 483.7376a25.57952 25.57952 0 0 1-18.8416-42.9056l112.6912-122.2656c9.5744-10.3936 25.8048-11.0592 36.1472-1.4848a25.57952 25.57952 0 0 1 1.4848 36.1472l-112.6912 122.2656a25.36448 25.36448 0 0 1-18.7904 8.2432z"
                            fill="#FFAF50" p-id="5487"></path>
                    </svg>
                    <h2>{{ payInfo.amount }}</h2>
                </div>
                <div style="margin: 30px 0 20px 0">
                    支付方式：
                    <el-radio-group v-model="payType" class="radio-group">
                        <el-radio :value="1" size="large" border class="radio-box">
                            <div class="myCenter">
                                <div
                                    style="display: flex; flex-direction: column; justify-content:center;align-items: start;">
                                    <span>支付宝支付</span>
                                    <span>个人转账</span>
                                    <span>不支持信用卡</span>
                                </div>
                                <svg t="1725767902962" class="icon" viewBox="0 0 1024 1024" version="1.1"
                                    xmlns="http://www.w3.org/2000/svg" p-id="2548" width="32" height="32"
                                    style="margin: 0 0 0 10px">
                                    <path
                                        d="M230.771014 576.556522c-12.614493 9.646377-25.228986 23.744928-28.93913 42.295652-5.194203 24.486957-0.742029 55.652174 22.26087 80.13913 28.93913 28.93913 72.718841 37.101449 92.011594 38.585508 51.2 3.710145 106.110145-22.26087 147.663768-50.457971 16.324638-11.130435 43.77971-34.133333 70.492754-69.750725-59.362319-30.423188-133.565217-64.556522-212.22029-61.588406-41.553623 1.484058-70.492754 9.646377-91.269566 20.776812zM983.188406 712.347826c25.971014-61.588406 40.811594-129.113043 40.811594-200.347826 0-281.971014-230.028986-512-512-512S0 230.028986 0 512s230.028986 512 512 512c170.666667 0 321.298551-83.849275 414.794203-212.22029C838.492754 768.742029 693.797101 696.023188 604.011594 652.985507c-42.295652 48.973913-105.368116 97.205797-176.602898 117.982609-44.521739 13.356522-85.333333 18.550725-126.886957 9.646377-42.295652-8.904348-72.718841-28.197101-90.527536-47.489855-8.904348-10.388406-19.292754-22.26087-27.455073-37.843479 0.742029 0.742029 0.742029 2.226087 0.742029 2.968116 0 0-4.452174-7.42029-7.420289-19.292753-1.484058-5.936232-2.968116-11.872464-3.710145-17.808696-0.742029-4.452174-0.742029-8.904348 0-12.614493-0.742029-7.42029 0-15.582609 1.484058-23.744927 4.452174-20.776812 12.614493-43.77971 35.617391-65.298551 48.973913-48.231884 115.014493-50.457971 149.147826-50.457971 50.457971 0.742029 138.017391 22.26087 212.22029 48.973913 20.776812-43.77971 34.133333-89.785507 42.295652-121.692754H304.973913v-33.391304h158.052174v-66.782609H272.324638v-34.133333h190.701449v-66.782609c0-8.904348 2.226087-16.324638 16.324638-16.324637h74.944927v83.107246h207.026087v33.391304H554.295652v66.782609H719.768116S702.701449 494.933333 651.501449 586.202899c115.014493 40.811594 277.518841 104.626087 331.686957 126.144927z m0 0"
                                        fill="#06B4FD" p-id="2549"></path>
                                </svg>
                            </div>
                        </el-radio>
                        <el-radio :value="2" size="large" border class="radio-box">
                            <div class="myCenter">
                                <div
                                    style="display: flex; flex-direction: column; justify-content:center;align-items: start;">
                                    <span>微信支付</span>
                                    <span>个人转账</span>
                                    <span>不支持信用卡</span>
                                </div>
                                <svg t="1725767966081" class="icon" viewBox="0 0 1144 1024" version="1.1"
                                    xmlns="http://www.w3.org/2000/svg" p-id="3592" width="32" height="32"
                                    style="margin: 0 0 0 10px">
                                    <path
                                        d="M436.314353 632.771765c-68.517647 36.321882-78.667294-20.389647-78.667294-20.389647l-85.835294-190.524236c-33.039059-90.533647 28.581647-40.839529 28.581647-40.839529s52.856471 38.038588 93.003294 61.229176c40.086588 23.190588 85.835294 6.806588 85.835294 6.806589l561.212235-246.362353C936.899765 80.112941 765.891765 0 572.235294 0 256.180706 0 0 213.232941 0 476.310588c0 151.311059 84.811294 285.967059 216.937412 373.248l-23.792941 130.288941s-11.625412 38.038588 28.611764 20.389647c27.437176-12.047059 97.370353-55.115294 138.992941-81.347764 65.445647 21.684706 136.734118 33.731765 211.486118 33.731764 316.024471 0 572.235294-213.232941 572.235294-476.310588 0-76.197647-21.594353-148.178824-59.843764-212.028235-178.808471 102.309647-594.733176 340.118588-648.312471 368.489412z"
                                        fill="#43C93E" p-id="3593"></path>
                                </svg>
                            </div>
                        </el-radio>
                    </el-radio-group>
                </div>
                <div style="margin: 0 0 20px 0;">
                    支付金额：<span style="color: red;"><span>{{ payInfo.amount }}</span></span> 元
                </div>
                <div class="myCenter">
                    <el-button @click="cancelSelectPay()">取消</el-button>
                    <el-button @click="pay()" type="primary">立即支付</el-button>
                </div>
            </div>
        </el-dialog>

        <el-dialog draggable :title="payType === 1 ? '支付宝支付' : '微信支付'" v-model="showPayQrCode" width="45%"
            :append-to-body="true" :close-on-click-modal="false" destroy-on-close top="25vh" :show-close="false">
            <div class="myCenter" style="flex-direction: column;">
                <div class="myCenter" style="margin-bottom: 20px">
                    <svg v-if="payType === 1" t="1725955323939" class="icon" viewBox="0 0 1024 1024" version="1.1"
                        xmlns="http://www.w3.org/2000/svg" p-id="8096" width="28" height="28"
                        style="margin: 0 10px 0 0">
                        <path
                            d="M860.16 0C950.272 0 1024 73.889684 1024 164.163368v531.509895s-32.768-4.122947-180.224-53.355789c-40.96-14.362947-96.256-34.896842-157.696-57.478737 36.864-63.595789 65.536-137.485474 86.016-215.444211h-202.752v-71.841684h247.808V256.512h-247.808V135.437474h-100.352c-18.432 0-18.432 18.458947-18.432 18.458947v104.663579H200.704v41.040842h249.856v69.793684H243.712v41.013895H645.12c-14.336 51.307789-34.816 98.519579-57.344 141.608421-129.024-43.115789-268.288-77.985684-356.352-55.403789-55.296 14.362947-92.16 38.992842-112.64 63.595789-96.256 116.978526-26.624 295.504842 176.128 295.504842 120.832 0 237.568-67.718737 327.68-178.526316C757.76 742.858105 1024 853.692632 1024 853.692632v6.144C1024 950.110316 950.272 1024 860.16 1024H163.84C73.728 1024 0 950.137263 0 859.836632V164.163368C0 73.889684 73.728 0 163.84 0h696.32zM268.126316 553.121684c93.049263-10.374737 180.062316 26.974316 283.270737 78.874948-74.886737 95.501474-165.941895 155.701895-256.970106 155.701894-157.830737 0-204.368842-126.652632-125.466947-197.200842 26.300632-22.851368 72.838737-35.301053 99.166316-37.376z"
                            fill="#00A0EA" p-id="8097"></path>
                    </svg>
                    <svg v-if="payType === 2" t="1725955395797" class="icon" viewBox="0 0 1024 1024" version="1.1"
                        xmlns="http://www.w3.org/2000/svg" p-id="9963" width="28" height="28"
                        style="margin: 0 10px 0 0">
                        <path
                            d="M891.380364 0h-764.043637C57.285818 0 0 57.297455 0 127.336727v764.043637c0 70.050909 57.297455 127.336727 127.336727 127.336727h764.043637c70.050909 0 127.336727-57.297455 127.336727-127.336727v-764.043637C1018.717091 57.285818 961.419636 0 891.380364 0z m-382.021819 783.150545c-44.567273 0-82.781091-6.376727-120.96-19.118545-25.472 12.741818-63.674182 44.567273-76.404363 50.944-25.472 12.730182-19.118545-12.741818-19.118546-12.741818l12.741819-76.404364C229.213091 674.909091 184.634182 592.128 184.634182 502.993455c0-159.185455 146.443636-286.510545 324.724363-286.510546 108.253091 0 210.094545 50.932364 267.403637 120.971636L458.437818 483.886545s-25.472 12.741818-50.944-6.353454l-50.932363-38.202182s-38.202182-31.848727-19.10691 19.083636l50.932364 114.618182s6.376727 31.825455 44.578909 12.730182c31.848727-12.730182 267.403636-159.162182 369.28-216.482909 19.118545 38.202182 31.825455 82.781091 31.825455 127.348364 0 152.808727-146.420364 286.522182-324.701091 286.522181z"
                            fill="#48B338" p-id="9964"></path>
                    </svg>

                    <div style="display: flex;flex-direction: column;align-items: center;">
                        <span>扫一扫付款（元）</span>
                        <span style="color: rgb(251 149 42);font-size: 20px;font-weight: 1000;">
                            {{ payInfo.amount }}
                        </span>
                    </div>
                </div>
                <el-card class="pay-card">
                    <div style="display: flex;flex-direction: column;align-items: center;">
                        <el-image :src="webStaticResourcePrefix + 'assets/image/zfb_qr_code.png'"
                            style="width: 200px;height: 200px;" />
                        <div class="myCenter">
                            <svg t="1725953832198" class="icon" viewBox="0 0 1024 1024" version="1.1"
                                xmlns="http://www.w3.org/2000/svg" p-id="5428" width="28" height="28">
                                <path
                                    d="M853.333333 938.666667h-128v-64h128a21.333333 21.333333 0 0 0 21.333334-21.333334v-138.666666a32 32 0 0 1 64 0V853.333333a85.333333 85.333333 0 0 1-85.333334 85.333334z m53.333334-597.333334a32 32 0 0 1-32-32V170.666667a21.333333 21.333333 0 0 0-21.333334-21.333334h-138.666666a32 32 0 0 1 0-64H853.333333a85.333333 85.333333 0 0 1 85.333334 85.333334v138.666666a32 32 0 0 1-32 32z m-597.333334-192H170.666667a21.333333 21.333333 0 0 0-21.333334 21.333334v138.666666a32 32 0 1 1-64 0V170.666667a85.333333 85.333333 0 0 1 85.333334-85.333334h138.666666a32 32 0 0 1 0 64z m-192 533.333334A32 32 0 0 1 149.333333 714.666667V853.333333a21.333333 21.333333 0 0 0 21.333334 21.333334h128v64H170.666667a85.333333 85.333333 0 0 1-85.333334-85.333334v-138.666666A32 32 0 0 1 117.333333 682.666667z"
                                    fill="#333333" p-id="5429"></path>
                                <path
                                    d="M213.333333 480m32 0l533.333334 0q32 0 32 32l0 0q0 32-32 32l-533.333334 0q-32 0-32-32l0 0q0-32 32-32Z"
                                    fill="#FF9C00" p-id="5430"></path>
                            </svg>
                            <div
                                style="display: flex;flex-direction: column;align-items: center;margin: 0 0 10px 10px;">
                                <span v-if="payType === 1">打开手机支付宝</span>
                                <span v-if="payType === 2">打开手机微信</span>
                                <span>扫一扫继续付款</span>
                            </div>
                        </div>
                    </div>
                </el-card>
            </div>
            <div class="myCenter" style="margin: 30px 0 20px;">
                <el-button @click="cancelPay()">取消支付</el-button>
                <el-button @click="paySuccess()" type="success">支付成功</el-button>
            </div>
        </el-dialog>

        <el-dialog draggable title="填写工单" v-model="showWorkOrderDialog" width="45%" :append-to-body="true"
            :close-on-click-modal="false" destroy-on-close top="15vh" :show-close="false">
            <el-form ref="ruleFormRef" :model="workOrder" :rules="rules" label-width="auto" status-icon>
                <el-form-item label="商户订单号" prop="orderNo" required>
                    <el-input v-model="workOrder.orderNo" disabled />
                </el-form-item>
                <el-form-item label="文章标题" prop="articleTitle" required>
                    <el-input v-model="workOrder.articleTitle" disabled />
                </el-form-item>
                <el-form-item label="支付方式" prop="payType" required>
                    <el-radio-group v-model="workOrder.payType" class="radio-group" disabled>
                        <el-radio :value="1" size="large" border class="radio-box"
                            :style="workOrder.payType === 1 ? 'border-color: var(--el-color-primary);' : 'border-color: var(--el-border-color-lighter);'">
                            <div class="myCenter">
                                <div
                                    style="display: flex; flex-direction: column; justify-content:center;align-items: start;">
                                    <span style="line-height: 18px;">支付宝支付</span>
                                    <span style="line-height: 18px;">个人转账</span>
                                    <span style="line-height: 18px;">不支持信用卡</span>
                                </div>
                                <svg t="1725767902962" class="icon" viewBox="0 0 1024 1024" version="1.1"
                                    xmlns="http://www.w3.org/2000/svg" p-id="2548" width="32" height="32"
                                    style="margin: 0 0 0 10px">
                                    <path
                                        d="M230.771014 576.556522c-12.614493 9.646377-25.228986 23.744928-28.93913 42.295652-5.194203 24.486957-0.742029 55.652174 22.26087 80.13913 28.93913 28.93913 72.718841 37.101449 92.011594 38.585508 51.2 3.710145 106.110145-22.26087 147.663768-50.457971 16.324638-11.130435 43.77971-34.133333 70.492754-69.750725-59.362319-30.423188-133.565217-64.556522-212.22029-61.588406-41.553623 1.484058-70.492754 9.646377-91.269566 20.776812zM983.188406 712.347826c25.971014-61.588406 40.811594-129.113043 40.811594-200.347826 0-281.971014-230.028986-512-512-512S0 230.028986 0 512s230.028986 512 512 512c170.666667 0 321.298551-83.849275 414.794203-212.22029C838.492754 768.742029 693.797101 696.023188 604.011594 652.985507c-42.295652 48.973913-105.368116 97.205797-176.602898 117.982609-44.521739 13.356522-85.333333 18.550725-126.886957 9.646377-42.295652-8.904348-72.718841-28.197101-90.527536-47.489855-8.904348-10.388406-19.292754-22.26087-27.455073-37.843479 0.742029 0.742029 0.742029 2.226087 0.742029 2.968116 0 0-4.452174-7.42029-7.420289-19.292753-1.484058-5.936232-2.968116-11.872464-3.710145-17.808696-0.742029-4.452174-0.742029-8.904348 0-12.614493-0.742029-7.42029 0-15.582609 1.484058-23.744927 4.452174-20.776812 12.614493-43.77971 35.617391-65.298551 48.973913-48.231884 115.014493-50.457971 149.147826-50.457971 50.457971 0.742029 138.017391 22.26087 212.22029 48.973913 20.776812-43.77971 34.133333-89.785507 42.295652-121.692754H304.973913v-33.391304h158.052174v-66.782609H272.324638v-34.133333h190.701449v-66.782609c0-8.904348 2.226087-16.324638 16.324638-16.324637h74.944927v83.107246h207.026087v33.391304H554.295652v66.782609H719.768116S702.701449 494.933333 651.501449 586.202899c115.014493 40.811594 277.518841 104.626087 331.686957 126.144927z m0 0"
                                        fill="#06B4FD" p-id="2549"></path>
                                </svg>
                            </div>
                        </el-radio>
                        <el-radio :value="2" size="large" border class="radio-box"
                            :style="workOrder.payType === 2 ? 'border-color: var(--el-color-primary);' : 'border-color: var(--el-border-color-lighter);'">
                            <div class="myCenter">
                                <div
                                    style="display: flex; flex-direction: column; justify-content:center;align-items: start;">
                                    <span style="line-height: 18px;">微信支付</span>
                                    <span style="line-height: 18px;">个人转账</span>
                                    <span style="line-height: 18px;">不支持信用卡</span>
                                </div>
                                <svg t="1725767966081" class="icon" viewBox="0 0 1144 1024" version="1.1"
                                    xmlns="http://www.w3.org/2000/svg" p-id="3592" width="32" height="32"
                                    style="margin: 0 0 0 10px">
                                    <path
                                        d="M436.314353 632.771765c-68.517647 36.321882-78.667294-20.389647-78.667294-20.389647l-85.835294-190.524236c-33.039059-90.533647 28.581647-40.839529 28.581647-40.839529s52.856471 38.038588 93.003294 61.229176c40.086588 23.190588 85.835294 6.806588 85.835294 6.806589l561.212235-246.362353C936.899765 80.112941 765.891765 0 572.235294 0 256.180706 0 0 213.232941 0 476.310588c0 151.311059 84.811294 285.967059 216.937412 373.248l-23.792941 130.288941s-11.625412 38.038588 28.611764 20.389647c27.437176-12.047059 97.370353-55.115294 138.992941-81.347764 65.445647 21.684706 136.734118 33.731765 211.486118 33.731764 316.024471 0 572.235294-213.232941 572.235294-476.310588 0-76.197647-21.594353-148.178824-59.843764-212.028235-178.808471 102.309647-594.733176 340.118588-648.312471 368.489412z"
                                        fill="#43C93E" p-id="3593"></path>
                                </svg>
                            </div>
                        </el-radio>
                    </el-radio-group>
                </el-form-item>
                <el-form-item label="支付金额" prop="payAmount" required>
                    <el-input v-model="workOrder.payAmount" disabled />
                </el-form-item>
                <el-form-item prop="payOrderNo" required>
                    <template #label>
                        <div class="myCenter pop-el">
                            交易订单号
                            <el-popover placement="top-start" popper-class="pop-pay-tips" :width="200" trigger="hover">
                                <template #reference>
                                    <svg t="1726823848351" style="cursor: pointer;" viewBox="0 0 1024 1024"
                                        version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="2408" width="20"
                                        height="20">
                                        <path
                                            d="M512 958.017C266.08 958.017 65.983 757.952 65.983 512 65.983 266.08 266.08 65.983 512 65.983c245.952 0 446.017 200.065 446.017 446.017S757.952 958.017 512 958.017z m0-828.034c-210.656 0-382.017 171.36-382.017 382.017 0 210.625 171.36 382.017 382.017 382.017 210.625 0 382.017-171.36 382.017-382.017S722.625 129.983 512 129.983z"
                                            p-id="2409" fill="#707070"></path>
                                        <path
                                            d="M464 304c0 26.51 21.49 48 48 48s48-21.49 48-48-21.49-48-48-48-48 21.49-48 48zM512 768c-17.665 0-32-14.303-32-32V448c0-17.665 14.335-32 32-32s32 14.335 32 32v288c0 17.697-14.335 32-32 32z"
                                            p-id="2410" fill="#707070"></path>
                                    </svg>
                                </template>
                                <template #default>
                                    交易系统订单号：交易系统交易完成后自动生成的订单号。注：不是商户订单号
                                </template>
                            </el-popover>
                        </div>
                    </template>
                    <el-input v-model="workOrder.payOrderNo" clearable maxlength="64" />
                </el-form-item>
                <el-form-item prop="payPicture" required>
                    <template #label>
                        <div class="myCenter pop-el">
                            支付凭证
                            <el-popover placement="top-start" title="示例图"
                                popper-class="pop-pay-tips" :width="240" trigger="hover">
                                <template #reference>
                                    <svg t="1726823848351" style="cursor: pointer;" viewBox="0 0 1024 1024"
                                        version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="2408" width="20"
                                        height="20">
                                        <path
                                            d="M512 958.017C266.08 958.017 65.983 757.952 65.983 512 65.983 266.08 266.08 65.983 512 65.983c245.952 0 446.017 200.065 446.017 446.017S757.952 958.017 512 958.017z m0-828.034c-210.656 0-382.017 171.36-382.017 382.017 0 210.625 171.36 382.017 382.017 382.017 210.625 0 382.017-171.36 382.017-382.017S722.625 129.983 512 129.983z"
                                            p-id="2409" fill="#707070"></path>
                                        <path
                                            d="M464 304c0 26.51 21.49 48 48 48s48-21.49 48-48-21.49-48-48-48-48 21.49-48 48zM512 768c-17.665 0-32-14.303-32-32V448c0-17.665 14.335-32 32-32s32 14.335 32 32v288c0 17.697-14.335 32-32 32z"
                                            p-id="2410" fill="#707070"></path>
                                    </svg>
                                </template>
                                <template #default>
                                    <el-image v-if="workOrder.payType == 1" style="width: 220px;height: 200px"
                                        :src="webStaticResourcePrefix + 'assets/image/zfb_tips.png'"
                                        fit="cover"></el-image>
                                    <el-image v-else-if="workOrder.payType == 2" style="width: 220px;height: 200px"
                                        :src="webStaticResourcePrefix + 'assets/image/wx_tips.png'"
                                        fit="cover"></el-image>
                                </template>
                            </el-popover>
                        </div>
                    </template>
                    <div class="myCenter" style="flex-direction: column;width: 100%">
                        <div style="display: flex;width: 100%">
                            <el-input v-model="workOrder.payPicture" disabled></el-input>
                            <el-image class="upload-img" lazy style="margin-left: 10px" :src="workOrder.payPicture"
                                fit="cover"></el-image>
                        </div>
                        <UploadPicture :prefix="'orderVoucher'" style="margin-top: 10px;width: 100%"
                            @addPicture="addOrderVoucher" :maxSize="2" :maxNumber="1"></UploadPicture>
                    </div>
                </el-form-item>
                <el-form-item>
                    <div class="myCenter" style="margin: 30px 0 20px;width: 100%;margin-left: 20%">
                        <el-button @click="cancelOrder(ruleFormRef)">取消</el-button>
                        <el-button @click="submitOrder(ruleFormRef)" type="primary">提交工单</el-button>
                    </div>
                </el-form-item>
            </el-form>

        </el-dialog>
    </div>
</template>

<script setup>
import MyFooter from '../components/common/MyFooter.vue';
import Comment from '../components/comment/Comment.vue';
import Process from '../components/common/Process.vue';
import CommentBox from '../components/comment/CommentBox.vue';
import VideoPlayer from '../components/common/VideoPlayer.vue';
import UploadPicture from '../components/common/UploadPicture.vue';

import { useRoute, useRouter } from 'vue-router';
import MarkdownIt from 'markdown-it';

import videoPlayerPlugin from '../utils/markdown-it-video-plugin.js';
import openLinksPlugin from '../utils/markdown-it-link-open-plugin.js';
import multimdTablePlugin from 'markdown-it-multimd-table';

import { reactive, inject, toRefs, nextTick, onMounted, onUnmounted, watch, ref } from 'vue';
import { ElMessage, ElMessageBox, ElNotification } from 'element-plus';

import { Pointer } from '@element-plus/icons-vue'
import { useStore } from 'vuex';

const route = useRoute();
const router = useRouter();

const store = useStore();

// hooks
const common = inject("$common");
const constant = inject("$constant");
const http = inject("$http");

const data = reactive({
    id: route.params.id,
    subscribe: false,
    article: {},
    articleContentHtml: '',
    treeHoleList: [],
    weiYanDialogVisible: false,
    copyrightDialogVisible: false,
    newsTime: '',
    scrollTop: 0,
    buyArticleDialog: false,
    payInfo: {
        tips: '',
        amount: ''
    },
    payType: 1,
    showPayQrCode: false,
    showWorkOrderDialog: false,
    webStaticResourcePrefix: import.meta.env.VITE_WEB_STATIC_RESOURCE_PREFIX,
    workOrder: {
        orderNo: '',
        articleTitle: '',
        userId: '',
        articleId: '',
        payType: '',
        payAmount: '',
        payPicture: '',
        payOrderNo: ''
    },
    rules: {
        orderNo: [
            { required: true, message: '请输入商家订单号', trigger: 'change' },
        ],
        articleTitle: [
            { required: true, message: '请输入文章标题', trigger: 'change' },
        ],
        payType: [
            { required: true, message: '请输入支付方式', trigger: 'change' },
        ],
        payAmount: [
            { required: true, message: '请输入支付金额', trigger: 'change' },
        ],
        payOrderNo: [
            { required: true, message: '请输入交易订单号', trigger: 'change' },
        ],
        payPicture: [{ required: true, message: '请上传支付凭证', trigger: 'change' }],
    },
});

const ruleFormRef = ref(null);

onMounted(() => {
    window.addEventListener('scroll', onScrollPage);

    if (!common.isEmpty(data.id)) {
        getArticle();

        ElNotification.success({
            title: '文章订阅',
            offset: 80,
            message: '点击文章下方小手 - 订阅/取消订阅专栏（标签）',
            duration: 5000,
        });
    }
});
onUnmounted(() => {
    window.removeEventListener('scroll', onScrollPage);
});
watch(() => data.scrollTop, (newScrollTop) => {
    let isShow = newScrollTop - window.innerHeight > 30;
    if (isShow) {
        $('#toc-button').css('bottom', '12vh');
    } else {
        $('#toc-button').css('bottom', '6.5vh');
    }
});

// methods
const clickTocButton = () => {
    let display = $('.toc');
    if ('none' === display.css('display')) {
        display.css('display', 'unset');
    } else {
        display.css('display', 'none');
    }
};

const subscribeLabel = () => {
    if (common.isEmpty(store.state.currentUser)) {
        ElMessage({
            message: '请先登录！',
            type: 'error',
        });
        return;
    }

    ElMessageBox.confirm(
        '确认' +
        (data.subscribe ? '取消订阅' : '订阅') +
        '专栏【' +
        data.article.label.labelName +
        '】？' +
        (data.subscribe
            ? ''
            : '订阅专栏后，该专栏发布新文章将通过邮件通知订阅用户。'),
        data.subscribe ? '取消订阅' : '文章订阅',
        {
            confirmButtonText: '确定',
            cancelButtonText: '取消',
            center: true,
        }
    )
        .then(() => {
            http.get(constant.baseURL + '/user/subscribe', {
                labelId: data.article.labelId,
                flag: !data.subscribe
            }).then((res) => {
                if (!common.isEmpty(res.data)) {
                    store.commit('loadCurrentUser', res.data);
                }
                data.subscribe = !data.subscribe;
            }).catch((error) => {
                ElMessage({
                    message: error.message,
                    type: 'error'
                });
            });
        })
        .catch(() => {
            ElMessage({
                type: 'success',
                message: '已取消!',
            });
        });
};


const deleteTreeHole = (id) => {
    if (common.isEmpty(store.state.currentUser)) {
        ElMessage({
            message: '请先登录！',
            type: 'error',
        });
        return;
    }

    ElMessageBox.confirm('确认删除？', '提示', {
        confirmButtonText: '确定',
        cancelButtonText: '取消',
        type: 'success',
        center: true,
    })
        .then(() => {
            http.get(constant.baseURL + '/weiYan/deleteWeiYan', { id: id })
                .then((res) => {
                    ElMessage({
                        type: 'success',
                        message: '删除成功!',
                    });
                    getNews();
                })
                .catch((error) => {
                    ElMessage({
                        message: error.message,
                        type: 'error',
                    });
                });
        })
        .catch(() => {
            ElMessage({
                type: 'success',
                message: '已取消删除!',
            });
        });
};

const submitWeiYan = (content) => {
    const weiYan = {
        content: content,
        createTime: data.newsTime,
        source: data.article.id,
    };

    http.post(constant.baseURL + '/weiYan/saveNews', weiYan)
        .then((res) => {
            data.weiYanDialogVisible = false;
            data.newsTime = '';
            getNews();
        })
        .catch((error) => {
            ElMessage({
                message: error.message,
                type: 'error',
            });
        });
};

const getNews = () => {
    http.post(constant.baseURL + '/weiYan/listNews', {
        current: 1,
        size: 9999,
        source: data.article.id,
    })
        .then((res) => {
            if (!common.isEmpty(res.data)) {
                res.data.records.forEach((c) => {
                    c.content = c.content.replace(
                        /\n{2,}/g,
                        '<div style="height: 12px"></div>'
                    );
                    c.content = c.content.replace(/\n/g, '<br/>');
                    c.content = common.faceReg(c.content);
                    c.content = common.pictureReg(c.content);
                });
                data.treeHoleList = res.data.records;
            }
        })
        .catch((error) => {
            ElMessage({
                message: error.message,
                type: 'error',
            });
        });
};

const onScrollPage = () => {
    data.scrollTop =
        document.documentElement.scrollTop || document.body.scrollTop;
    if (data.scrollTop < window.innerHeight / 4) {
        $('.toc').css('top', window.innerHeight / 4);
    } else {
        $('.toc').css('top', '90px');
    }
};

const getTocbot = () => {
    const script = document.createElement('script');
    script.type = 'text/javascript';
    script.src = constant.tocbot;
    document.getElementsByTagName('head')[0].appendChild(script);

    // 引入成功
    script.onload = function () {
        tocbot.init({
            tocSelector: '#toc',
            contentSelector: '.entry-content',
            headingSelector: 'h1, h2, h3, h4, h5',
            scrollSmooth: true,
            fixedSidebarOffset: 'auto',
            scrollSmoothOffset: -100,
            hasInnerContainers: false,
        });
    };
    $('.toc').css('display', 'none');
};

const addId = () => {
    const headings = $('.entry-content').find('h1, h2, h3, h4, h5, h6');
    headings.attr('id', (i, id) => id || 'toc-' + i);
};

const getArticle = () => {
    http.get(constant.baseURL + '/article/getArticleById', {
        articleId: data.id,
        userId: common.isEmpty(store.state.currentUser) ? '' : store.state.currentUser.id,
    })
        .then((res) => {
            if (!common.isEmpty(res.data)) {
                data.article = res.data;
                getNews();
                const md = new MarkdownIt({ breaks: true })
                    .use(multimdTablePlugin)
                    .use(videoPlayerPlugin)
                    .use(openLinksPlugin);

                data.articleContentHtml = md.render(data.article.articleContent);
                nextTick(() => {
                    common.imgShow('.entry-content img');
                    highlight();
                    addId();
                    getTocbot();
                });
                if (
                    !common.isEmpty(store.state.currentUser) &&
                    !common.isEmpty(store.state.currentUser.subscribe)
                ) {
                    data.subscribe = JSON.parse(
                        store.state.currentUser.subscribe
                    ).includes(data.article.labelId);
                }
            }
        })
        .catch((error) => {
            if (error.message === '待审核') {
                ElMessageBox.alert('您在该文章下有一笔订单正在审核中，请等待审核结果~~', '⛔文章提示', {
                    autofocus: false,
                    confirmButtonText: '确定',
                    showClose: false,
                    customStyle: 'background-color: rgb(234 229 203);',
                    callback: () => {
                        router.push({ path: '/' });
                    }
                });
                return;
            }

            if (error.message === '请先登录') {
                ElMessageBox.alert('当前文章是私有文章，请先登录，确保拥有相关权限', '⛔文章提示', {
                    autofocus: false,
                    confirmButtonText: '确定',
                    customStyle: 'background-color: rgb(234 229 203);',
                    showClose: false,
                    callback: () => {
                        router.push({ path: '/' });
                    }
                });
                return;
            }
            // 根据data.id获取付费金额
            http.get(constant.baseURL + '/article/getPayInfo', {
                articleId: data.id
            }).then((res) => {
                data.buyArticleDialog = true;
                data.payInfo.amount = res.data.amount;
                data.payInfo.tips = res.data.tips;
                data.workOrder.articleTitle = res.data.articleTitle;
            })

        });
};

const cancelSelectPay = () => {
    data.buyArticleDialog = false;
    ElMessage({
        message: '取消支付',
        type: 'error',
    });
    router.push({ path: '/' })
}

const cancelPay = () => {
    data.showPayQrCode = false;
    data.buyArticleDialog = true;
    ElMessage({
        message: '取消扫码，可选择支付方式后重新支付',
        type: 'warning',
    });
}

const pay = () => {
    if (common.isEmpty(data.payType)) {
        ElMessage({
            message: '请选择支付方式',
            type: 'error',
        });
        return;
    }
    data.buyArticleDialog = false;
    data.showPayQrCode = true;
}

const paySuccess = () => {
    data.showPayQrCode = false;
    data.showWorkOrderDialog = true;
    data.workOrder.articleId = data.id;
    data.workOrder.payType = data.payType;
    data.workOrder.payAmount = data.payInfo.amount;
    data.workOrder.orderNo = generateOrderNumber();
}

const addOrderVoucher = (res) => {
    data.workOrder.payPicture = res
}

const cancelOrder = () => {
    ElMessageBox.confirm('确定取消填写工单吗？后续可重新进入支付界面进入填写工单！！！', '提示', {
        confirmButtonText: '确定',
        cancelButtonText: '取消',
        type: 'warning',
    }).then(() => {
        data.showWorkOrderDialog = false;
        data.showPayQrCode = false;
        data.buyArticleDialog = false;
        router.push({ path: '/' });
    });
}

const submitOrder = (formEl) => {
    if (!formEl) return
    formEl.validate((valid) => {
        if (valid) {
            // 向后台新增订单记录
            let param = {
                articleId: data.id,
                payType: data.payType,
                payAmount: data.payInfo.amount,
                orderNo: data.workOrder.orderNo,
                userId: common.isEmpty(store.state.currentUser) ? '' : store.state.currentUser.id,
                payOrderNo: data.workOrder.payOrderNo,
                payPicture: data.workOrder.payPicture
            }

            http.post(constant.baseURL + '/workOrder/addWorkOrder', param, false)
                .then((res) => {
                    ElMessage({
                        message: '订单保存成功，请等待管理员审核(*^_^*)',
                        type: 'success',
                    });
                    data.showWorkOrderDialog = false;
                    data.showPayQrCode = false;
                    data.buyArticleDialog = false;
                    router.push({ path: '/' });
                })
                .catch((error) => {
                    ElMessage({
                        message: error.message,
                        type: 'error',
                    });
                });
        }
    })
}

const generateOrderNumber = () => {
    // 获取当前日期和时间
    const now = new Date();
    // 格式化日期和时间为 yyyyMMddHHmmss
    const year = now.getFullYear();
    const month = String(now.getMonth() + 1).padStart(2, '0'); // 月份从0开始，所以要加1
    const day = String(now.getDate()).padStart(2, '0');
    const hours = String(now.getHours()).padStart(2, '0');
    const minutes = String(now.getMinutes()).padStart(2, '0');
    const seconds = String(now.getSeconds()).padStart(2, '0');

    // 拼接日期时间字符串
    const dateTimeString = `${year}${month}${day}${hours}${minutes}${seconds}`;

    // 生成一个四位数的随机数
    const randomNum = Math.floor(Math.random() * 10000).toString().padStart(4, '0');

    // 组合成订单号
    const orderNumber = `${dateTimeString}${randomNum}`;

    return orderNumber;
}

const highlight = () => {
    const attributes = {
        autocomplete: 'off',
        autocorrect: 'off',
        autocapitalize: 'off',
        spellcheck: 'false',
        contenteditable: 'false',
    };

    $('pre').each(function (i, item) {
        const preCode = $(item).children('code');
        const classNameStr = preCode[0].className;
        const classNameArr = classNameStr.split(' ');

        let lang = '';
        classNameArr.some(function (className) {
            if (className.indexOf('language-') > -1) {
                lang = className.substring(
                    className.indexOf('-') + 1,
                    className.length
                );
                return true;
            }
        });

        // 检测语言是否存在，不存在则自动检测
        const language = hljs.getLanguage(lang.toLowerCase());
        if (language === undefined) {
            // 启用自动检测
            const autoLanguage = hljs.highlightAuto(preCode.text());
            preCode.removeClass('language-' + lang);
            lang = autoLanguage.language;
            if (lang === undefined) {
                lang = 'java';
            }
            preCode.addClass('language-' + lang);
        } else {
            lang = language.name;
        }

        $(item).addClass('highlight-wrap');
        $(item).attr(attributes);
        preCode
            .attr('data-rel', lang.toUpperCase())
            .addClass(lang.toLowerCase());
        // 启用代码高亮
        hljs.highlightElement(preCode[0]);
        // 启用代码行号
        hljs.lineNumbersBlock(preCode[0]);
    });

    $('pre code').each(function (i, block) {
        $(block).attr({
            id: 'hljs-' + i,
        });

        $(block).after(
            '<a class="copy-code" href="javascript:" data-clipboard-target="#hljs-' +
            i +
            '"><i class="fa fa-copy" aria-hidden="true"></i><span> 复制代码</span></a>'
        );
        // const cliphboard = new ClipboardJS(".copy-code");
    });

    const clipboard = new ClipboardJS('.copy-code');

    clipboard.on('success', function (e) {
        e.clearSelection(); // 取消选中内容

        // 修改按钮图标和文字
        const $copyButton = $(e.trigger);
        $copyButton.html(
            '<i class="fa fa-check" aria-hidden="true"></i><span> 复制成功！</span>'
        );

        // 3秒后恢复按钮图标和文字
        setTimeout(function () {
            $copyButton.html(
                '<i class="fa fa-copy" aria-hidden="true"></i><span> 复制代码</span>'
            );
        }, 3000);
    });

    clipboard.on('error', function (e) {
        e.clearSelection(); // 取消选中内容

        // 修改按钮图标和文字
        const $copyButton = $(e.trigger);
        $copyButton.html(
            '<i class="fa fa-remove" aria-hidden="true"></i><span> 复制失败！</span>'
        );

        // 3秒后恢复按钮图标和文字
        setTimeout(function () {
            $copyButton.html(
                '<i class="fa fa-copy" aria-hidden="true"></i><span> 复制代码</span>'
            );
        }, 3000);
    });

    if ($('.entry-content').children('table').length > 0) {
        $('.entry-content')
            .children('table')
            .wrap("<div class='table-wrapper'></div>");
    }
};
const { id, subscribe, article, articleContentHtml, treeHoleList, weiYanDialogVisible, copyrightDialogVisible,
    newsTime, buyArticleDialog, payInfo, payType, showPayQrCode, showWorkOrderDialog, webStaticResourcePrefix,
    workOrder, rules } = toRefs(data)

</script>
<style>
.video-wrapper {
    position: relative;
    width: 100%;
    padding-top: 50%;
    background-color: black;
    overflow: hidden;
    border-radius: 10px;
}

.video-wrapper video {
    position: absolute;
    top: 50%;
    left: 50%;
    width: auto;
    height: 100%;
    transform: translate(-50%, -50%);
    background-color: black;
    border-radius: 10px;
}

.video-wrapper video:focus {
    outline: none;
}

.custom-controls {
    position: absolute;
    bottom: 0;
    width: 100%;
    background-color: rgba(0, 0, 0, 0.7);
    color: white;
    display: flex;
    flex-direction: column;
    align-items: center;
    padding: 5px;
    box-sizing: border-box;
}

.top-controls,
.bottom-controls {
    display: flex;
    justify-content: space-between;
    width: 100%;
    padding: 5px;
    box-sizing: border-box;
}

.bottom-controls {
    justify-content: center;
}

.custom-controls button,
.custom-controls input,
.custom-controls select {
    background: none;
    border: none;
    color: white;
    font-size: 16px;
    margin: 0 5px;
    cursor: pointer;
}

.custom-controls input[type='range'] {
    width: 100px;
    height: 5px;
    background: linear-gradient(to right,
            red,
            orange,
            yellow,
            green,
            blue,
            indigo,
            violet);
    outline: none;
    opacity: 0.7;
    transition: opacity 0.2s;
}

.custom-controls input[type='range']::-webkit-slider-thumb {
    -webkit-appearance: none;
    appearance: none;
    width: 10px;
    height: 10px;
    background: white;
    cursor: pointer;
}

.custom-controls input[type='range']::-moz-range-thumb {
    width: 10px;
    height: 10px;
    background: white;
    cursor: pointer;
}

.volume-slider {
    display: none;
    position: absolute;
    bottom: 30px;
    left: 50%;
    transform: translateX(-50%);
    width: 5px;
    height: 100px;
    background: linear-gradient(to top,
            red,
            orange,
            yellow,
            green,
            blue,
            indigo,
            violet);
    outline: none;
    opacity: 0.7;
    transition: opacity 0.2s;
}

.volume-slider::-webkit-slider-thumb {
    -webkit-appearance: none;
    appearance: none;
    width: 10px;
    height: 10px;
    background: white;
    cursor: pointer;
}

.volume-slider::-moz-range-thumb {
    width: 10px;
    height: 10px;
    background: white;
    cursor: pointer;
}

.tips-box {
    width: 400px;
    background-color: #f2edd6;
}

.tips-box .el-message-box__title>span {
    font-weight: bold;
}

.buy-artcile {
    background-color: #f4f4ef !important;
}

.pay-card>div {
    padding: 0 10px 10px 10px;
}

.pop-el>span {
    display: flex;
    align-items: center;
    justify-content: center;
}
</style>

<style scoped>
.upload-img {
    border-radius: 2px;
    width: 40px;
    height: 40px;
}

.article-head {
    height: 40vh;
    position: relative;
}

.article-image::before {
    position: absolute;
    width: 100%;
    height: 100%;
    background-color: var(--miniMask);
    content: '';
}

.article-info-container {
    position: absolute;
    bottom: 15px;
    left: 20%;
    color: var(--white);
}

.article-info-news {
    position: absolute;
    bottom: 10px;
    right: 20%;
    cursor: pointer;
    animation: scale 1s ease-in-out infinite;
}

.article-title {
    font-size: 28px;
    margin-bottom: 15px;
}

.article-info {
    font-size: 14px;
    user-select: none;
}

.article-info i {
    margin-right: 6px;
}

.article-info span:not(:last-child) {
    margin-right: 5px;
}

.article-container {
    max-width: 800px;
    margin: 0 auto;
    padding: 40px 20px;
}

.article-update-time {
    color: var(--greyFont);
    font-size: 12px;
    margin: 20px 0;
    user-select: none;
}

blockquote {
    line-height: 2;
    border-left: 0.2rem solid var(--blue);
    padding: 10px 1rem;
    background-color: var(--azure);
    border-radius: 4px;
    margin: 0 0 40px 0;
    user-select: none;
    color: var(--black);
}

.article-sort {
    display: flex;
    justify-content: flex-end;
    margin-bottom: 20px;
}

.article-sort span {
    padding: 3px 10px;
    background-color: var(--themeBackground);
    border-radius: 5px;
    font-size: 14px;
    color: var(--white);
    transition: all 0.3s;
    margin-right: 25px;
    cursor: pointer;
    user-select: none;
}

.article-sort span:hover {
    background-color: var(--red);
}

.article-like {
    color: var(--red) !important;
}

.article-like-icon {
    font-size: 60px;
    cursor: pointer;
    color: var(--greyFont);
    transition: all 0.5s;
    border-radius: 50%;
    margin-bottom: 20px;
}

.article-like-icon:hover {
    transform: rotate(360deg);
}

.process-wrap {
    margin: 0 0 40px;
}

.process-wrap hr {
    position: relative;
    margin: 10px auto 60px;
    border: 2px dashed var(--lightGreen);
    overflow: visible;
}

.process-wrap hr:before {
    position: absolute;
    top: -14px;
    left: 5%;
    color: var(--lightGreen);
    content: '❄';
    font-size: 30px;
    line-height: 1;
    transition: all 1s ease-in-out;
}

.process-wrap hr:hover:before {
    left: calc(95% - 20px);
}

.process-wrap :deep(.el-collapse-item__header) {
    border-bottom: unset;
    font-size: 20px;
    background-color: var(--background);
    color: var(--lightGreen);
}

.process-wrap :deep(.el-collapse-item__wrap) {
    background-color: var(--background);
}

.process-wrap .el-collapse {
    border-top: unset;
    border-bottom: unset;
}

.process-wrap :deep(.el-collapse-item__wrap) {
    border-bottom: unset;
}

#toc-button {
    position: fixed;
    right: 3vh;
    bottom: 8vh;
    animation: slide-bottom 0.5s ease-in-out both;
    z-index: 100;
    cursor: pointer;
    font-size: 23px;
    width: 30px;
    right: 2.68vh;
}

#toc-button:hover {
    color: var(--themeBackground);
}

.copyright-container {
    color: var(--black);
    line-height: 2.5;
    padding: 0 30px 10px;
    font-size: 16px;
}

.text-box {
    width: 80%;
    margin-left: 10%;
}

.red-text {
    width: 100%;
    background-color: rgba(114, 208, 214, 0.664);
    color: #000;
    display: flex;
    flex-direction: column;
    justify-content: center;
    align-items: start;
    padding: 20px 10px 20px 10px;
}

.warn-text {
    width: 100%;
    height: 60px;
    background-color: rgb(243, 243, 216);
    color: red;
}

.radio-box {
    height: 7vh;
}

@media screen and (max-width: 700px) {
    .article-info-container {
        left: 20px;
        max-width: 320px;
    }

    .article-info-news {
        right: 20px;
    }
}

@media screen and (max-width: 400px) {
    #toc-button {
        right: 0.5vh;
    }
}

@media screen and (max-width: 872px) {
    .radio-group {
        margin-top: 10px;
    }
}

@media screen and (max-width: 694px) {
    .radio-box {
        height: 7vh;
        margin-top: 5px;
        margin-bottom: 5px;
    }
}
</style>
